export const GLOBAL_CONVERGENCE_MAJORS: string[] = [
  '데이터사이언스융합전공',
  '인공지능융합전공',
  '컬처엔테크놀로지융합전공',
];

//원전공 진입 가능 전공
export const APPLIABLE_MAJORS_FOR_FIRST_MAJOR: {
  [key: string]: string[];
} = {
  인문과학계열: [
    '국어국문학과',
    '독어독문학과',
    '러시아어문학과',
    '문헌정보학과',
    '사학과',
    '영어영문학과',
    '중어중문학과',
    '철학과',
    '프랑스어문학과',
    '한문학과',
    '유학동양학과',
    ...GLOBAL_CONVERGENCE_MAJORS,
  ],
  사회과학계열: [
    '경제학과',
    '통계학과',
    '미디어커뮤니케이션학과',
    '사회복지학과',
    '사회학과',
    '소비자학과',
    '심리학과',
    '아동청소년학과',
    '정치외교학과',
    '행정학과',
    ...GLOBAL_CONVERGENCE_MAJORS,
  ],
  자연과학계열: [
    '생명과학과',
    '수학과',
    '물리학과',
    '화학과',
    '식품생명공학과',
    '바이오메카트로닉스학과',
    '융합생명공학과',
    ...GLOBAL_CONVERGENCE_MAJORS,
  ],
  공학계열: [
    '화학공학/고분자시스템공학부',
    '신소재공학부',
    '기계공학부',
    '건설환경공학부',
    '시스템경영공학과',
    '나노공학과',
    ...GLOBAL_CONVERGENCE_MAJORS,
  ],
};
